global.idiaSessions = global.idiaSessions || {};

module.exports = {
  config: {
    name: "nastik",
    aliases: ["war3"],
    version: "7.0",
    author: "SK-SIDDIK-KHAN",
    role: 2,
    usePrefix: true,
    category: "user"
  },

  onStart: async function ({ message, event, bot }) {

    const chatId = event.chat.id;
    const text = event.text || "";
    const args = text.split(" ");

    if (args[1] && args[1].toLowerCase() === "off") {
      if (global.idiaSessions[chatId]) {
        clearInterval(global.idiaSessions[chatId]);
        delete global.idiaSessions[chatId];
      }
      return;
    }

    let userId = null;
    let name = "User";

    if (event.reply_to_message) {
      userId = event.reply_to_message.from.id;
      name = event.reply_to_message.from.first_name;
    }

    else if (event.entities) {
      const mention = event.entities.find(e => e.type === "mention");
      if (mention) {
        const username = text.substring(mention.offset + 1, mention.offset + mention.length);
        name = username;

      }
    }

    if (!userId && !text.includes("@")) {
      return message.reply("⚠️ | বস শুধু মাএ @ম্যানশন দেন তার পর দেখতেছি");
    }

    const mentionText = userId
      ? `<a href="tg://user?id=${userId}">${name}</a>`
      : `@${name}`;

    const texts = [
"তর মতো ফাজিল পলা পাইন এই প্রথম দেখলাম-!!😈।",
"টোকাই পলা পাইন-!!😹..",
"নাস্তিকদের জায়গায় নাই তদের মতো নাস্তিক কে পেলে হাতে পায়ের রগ কেতে দিতাম-!!🩸🪓",
"দুরব চাওয়া মর তোর মতো ফাজিল আমাদের গ্রুপ এ থাকার যোগ্য-!!😹😈",
"কামলা পলা পাইন কামলা দিবি দে এতো নাটক  কসর কেনো-!!😹",
"তুই তরা মা বাবার জারজ সন্তান-!!😈",
"বাপ চিনে লাগতে আসিস না হলে পরে আপসস করতে হবে-!!😈😹",
"ফাইলাম করি ভালো কথা তুই তর বাপের সাথে লাগতে আসবি কেনো রে নাস্তিক-!!🤬😈",
"তুই এতো টা খারাপ যে তোকে দেখে জাহান্নাম ও ভয়ে কান্না করছে-!!🙂",
"সময় থাকতে মানুষ হয়ে যা না হলে তরে আমাদের মানুষ করতে হবে-!!😈।",
"ভিক্ষা করে তর জীবন চলে আর তুই আসছোট বাবাদের সাথে লাগতে-!!😈।",
"দিন রাত হাত মাইরা বলস তুই পাপি নাহ তুই ভালো মানুষ-!!😹",
"টোকাই পলা পাইন আমাদের ডাস্টবিনের ময়লা আবর্জনা টুকিয়ে তর জীবন চলে আর তুই আমাদের উপরে আসস কথা বলতে-!!😹",
"থাপ্পর খাবি তো বাপ চিনবি-!!😹",
"ভিক্ষা মাইংগা খাস আবার বড়ো বড়ো কথা বলস সরম করে নাহ নাস্তিক-!!😹।",
"আমার ইসলাম এর সাথে লাগতে আসিস নাহ তোর জীবন এক থাপ্পড়ে শেষ করে দিবো",
"তর মতো নাস্তিক আমাদের পা চেটে খায় আর তুই আমাদের সাথে লাগতে আসোস-!!😹😈",
"আমাদের নামে উল্টো পালটা কথা বইলা তর জীবন নিয়ে টানা টানি করিস নাহ-!!😹",
"আমাদের পা চেটে খাওয়া পোলা পাইন আমাদের সাথে লাগতে আসবি-!!😈🤬",
"বাইমানি করি তাও আবার আমাদের সাথে তর নাম পরিবর্তন করে দিমু আসিস আমাদের এই খানে-!!😹",
"দিন রাত নেসা পানি খারাপ কাজ করে তুই বলিস মুমিন বান্দা-!!😹",
"তর মতো নাফরমানি বান্ধা আমাদের বাল এর জজ্ঞ নাহ-!!😹",
"তুই খারাপ কাজ করে আমাদের সাথে লাগতে আসবি তর হার গুরো করে দিবো-!!🦴😹",
"গালা গালি করবি তো মুখ শিলাই করে দিমহ-!!😁😷।",
"তোর মুখে ভাতরুমের গন্ধ যা আগে দাত মেঝে আয় পরে কথা বলিস-!!😁",
"তুই লাগবি আমাদের সাথে আসিস তোর জা আছে এখন পরে তা নিয়েও ফিরতে পারবি নাহ-!!😁",
"বাস্ট্রাড এর বাচ্ছা বস্তির পোলা-!!🤧🤮",
"তর মা বাবার জারজ শন্তান-!!🤬😈",
"তর মতো নাস্তিক পশুর থেকে নিক্রিসঠো-!!😈",
"তর জন্মদাতা রাস্তার কুত্তা-!!🤧😹",
"তুই কিত্তা তাই কুত্তার মতো শুধু গেও গেও করস-!!😹",
"তোর হয়তো জানা নেই ইসলাম কি জিনিস ইসলাম এর পাওয়ার কতো টুকু-!!😎⚡⛈️",
"সেই দিন কার কামলা পলা পাইন-!!😁",
"জুয়ারি গাঞ্জুটি পোলা পাইন ইসলামিক গ্রুপ এ থাকার জজ্ঞ নাহ-!!🤬",
"বস্তির ছেলে অনলাইনের কিং-!!😹",
"তুই টোকাই কিং-!!😹",
"টাকার অভাবে মরা গরু খাস-!!😹",
"টোকাই সেলিব্রেটি-!!😹",
"ভাত খাইবার ভাত পাস না আর কথা বলতে আসোস আমাদের সাথে-!!😹",
"ফকিন্নি পোলাপান-!!😹",
"বস্তিরন্দালাল এর বাচ্ছা বস্তির পোলা-!!😹",
"জারজ শন্তান জা ভাগ-!!😹😈",
"hare is বস্তি পোলা-!!😹",
"বান্তেয়ামি করার জায়গা পাস না-!!🤬",
"লাগতে আসিস নাহ ভারচুয়াল জগত হারাম করে দিমু-!!🤬😈",
"আব্বা ডাক তাহলে মানুষ হবার ট্রিক বলে দিমু-!!😹",
"আর বাপের সাথে লাগতে আসবি-!!😾😈",
"ঠাপ খাবি বাপ চিনবি-!!😹😈",
"তেরামি করবি গার মটকে দিবো-!!🤬😈",
"বারা বারি করবি তর বন রে নিয়ে পালাবো-!!🤧😈",
"বারা বারি করবি তোর মুখে হাইগ্যা দিমু-!!🤮😹",
"পাকনাকি করবি গু এর সাগরে ডুবাইয়া মারমু-!!😹🤮",
"তর রাতে আকাম করার ভিডিও ভাইরাল করে দিমু বারা বারি করবি তো-!!😹🤧",
"বেয়াদব দের সাথে কথা বলতে চাই না দূরে যাইয়া মর-!!🤧🤮",
"বেশি কাহিনি করবি তর বন রে নিয়ে কাহিনি বানিয়ে দিমু-!!😹",
"তুই কই তর বন এর টুনটুনি সই-!!😹🥵",
"পালাইস নাহ পালাইস নাহ এমন ঠাপ দিমু পালানো জায়গায় পাবি না-!!😹",
"তোর চিকোন সুন্দরী বন কে উম্মাহ-!!😹💋",
"বারি বারি করবি তোর বউ রে নিয়ে খেলমু পাট খেতে নিয়ে-!!😹",
"গালা গালি ৪২০ পাতার নাম পুদিনা তো মতো কা।লা পোলা পাইন চু**না-!!😈😹",
"হট করে দিমু তর বন রে তেরামি করবি তো-!!😹🥵",
"৯৯৯ এই নুম্বার এ কল দে তর বন রে কিডনাপ করমু-!!😹",
"তেরিং বেরিং করবি তো তর গুসঠি গারমু-!!😹🤬",
"গু খাওরা নাস্তিক-!!🤮😹",
"তেল মজামু আসিস-!!😹🤬",
"ওজান কুজাত এর জায়গা নাই আমার সহরে-!!🤬😈",
"তর মতাও নাস্তিক আমাদের সাথে লাগতে আসছে বাহ-!!😹",
"নাস্তিক এর বাচ্চা হিজলার সাথে তার কাতা-!!🤬🥵",
"নাস্তিক এর বাচ্চা এমন ঠাপ দিমু তোর বন রে শুধা লারাইয়া ফেলমু-!!😈🤬",
"তেরিং বেতিং করবি তোর বন এর জৌবোন নষ্ট করে দিমু-!!🥵😹",
"তর মার সাথে রাতে আকাম করগা ভালো না লাগলে-!!🥵🤬",
"কিং অফ ফকিন্নির পলা-!!✌️😈",
"কিং অফ ঘু খোর টোকাই পোলা-!!✌️😈",
"next time লাগতে আসার আগে ১০ বার ভাবিস-!!🤬😈"
    ];

    if (global.idiaSessions[chatId]) {
      clearInterval(global.idiaSessions[chatId]);
    }

    await message.reply(`📢 ${mentionText}, 🤬 | বজ্জাত নাস্তিক...`, {
      parse_mode: "HTML"
    });

    let i = 0;

    const interval = setInterval(async () => {
      await message.reply(`💡 ${texts[i % texts.length]} - ${mentionText}`, {
        parse_mode: "HTML"
      });
      i++;
    }, 1000);

    global.idiaSessions[chatId] = interval;
  }
};
